// Motion Pattern
// スプライトアニメーションの指定
// 
// MP NO.(モーションパターン番号）
// Wait Flame Time（アニメーションの間）フレームで指定
// Loop step (loop end number)　最小は0（アニメーションさせない）
// Sp no.,Mirror,Radian
// アニメパターンは最大で10パターンまでで
//  Mirror and Radian -1 -> Object data
//   1:上下反転　2:左右反転
//  Mirror and Radian -1 -> Object data
//　オブジェクトの持つラジアン値を使用する。
//
function motionPattern(){

	var mp = [];

	var no = 0;
	
	mp[no] = {};

	mp[no].wait = 0;
	//Boolean(mp[no].wait) = true = wait on;
	mp[no].pattern = [
	 ["Space", 0, 0 ]];

//自機
//=================================================
	no = 1;

	mp[no] = {};

	mp[no].pattern = [
	 ["Ship", 0, 0 ]];

//自機(左）
//=================================================
	no = 2;

	mp[no] = {};

	mp[no].pattern = [
	 ["Ship_r", 2, 0 ]];
//自機(右）
//=================================================
	no = 3;

	mp[no] = {};

	mp[no].pattern = [
	 ["Ship_r", 0, 0 ]];
//ENEMY
//=================================================
	no = 4;

	mp[no] = {};

	mp[no].wait = 18;
	mp[no].pattern = 
	[["Enemy1", 0, 0 ]
	,["Enemy2", 0, 0 ]
	,["Enemy3", 0, 0 ]];
//小弾
//=================================================
	no = 5;

	mp[no] = {};

	mp[no].wait = 10;
	mp[no].pattern = 
	[["S_Tama", 0, 0 ]
	,["S_Tama", 2, 0 ]
	,["S_Tama", 3, 0 ]
	,["S_Tama", 1, 0 ]];
//赤弾
//=================================================
	no = 6;

	mp[no] = {};

	mp[no].pattern = [
	 ["MoTama", 0, 0 ]];

//青弾
//=================================================
	no = 7;

	mp[no] = {};

	mp[no].pattern = [
	 ["MbTama", 0, 0 ]];

//矢玉
//=================================================
	no = 8;

	mp[no] = {};

	mp[no].pattern = [
	 ["YaTama", -1, -1 ]];
//自弾
//=================================================
	no = 9;

	mp[no] = {};

	mp[no].pattern = [
	 ["Zanki", 0, 0 ]];
//爆発
//=================================================
	no = 10;

	mp[no] = {};

	mp[no].wait = 10;
	mp[no].pattern = 
	[["Bomb3", 0, 0 ]
	,["Bomb1", 0, 0 ]
	,["Bomb2", 0, 0 ]
	,["Bomb3", 0, 0 ]
	,["Bomb4", 0, 0 ]
	,["Bomb5", 0, 0 ]];

//(|P|)
//=================================================
	no = 11;

	mp[no] = {};

	mp[no].wait = 5;
	mp[no].pattern = 
	[["Powup1", 0, 0 ]
	,["Powup2", 0, 0 ]
	,["Powup4", 0, 0 ]
	,["Powup3", 1, 0 ]
	,["Powup2", 1, 0 ]
	,["Powup1", 1, 0 ]
	,["Powup2", 1, 0 ]
	,["Powup3", 1, 0 ]
	,["Powup2", 0, 0 ]];

// Boss?
//=================================================
	no = 12;

	mp[no] = {};

	mp[no].pattern = [
	 ["Boss", -1, -1 ]];
//
//=================================================
	no = 13;

	mp[no] = {};

	mp[no].pattern = [
	 ["Wave", 0, 0 ]];
//
//=================================================
	no = 14;

	mp[no] = {};

	mp[no].pattern = [
	 ["Missile", -1, -1 ]];

//Option
//=================================================
	no = 15;

	mp[no] = {};

	mp[no].pattern = [
	 ["Option", 0, 0 ]];

//Rev2
//=================================================

	no = 15;

	mp[no] = {};

	mp[no].wait = 20;
	mp[no].pattern = 
	[["Option1", 0, 0 ]
	,["Option1", 1, 0 ]
	,["Option2", 1, 0 ]
	,["Option3", 0, 0 ]
	,["Option2", 0, 0 ]];
//看板１
//=================================================
	no = 16;

	mp[no] = {};

	mp[no].pattern = [
	 ["Boardw", 0, 0 ]];
//看板２
//=================================================
	no = 17;

	mp[no] = {};

	mp[no].pattern = [
	 ["Boardh", 0, 0 ]];
//[S]
//=================================================
	no = 18;

	mp[no] = {};

	mp[no].pattern = [
	 ["Bonus", 0, 0 ]];
//miniB
//=================================================
	no = 19;

	mp[no] = {};

	mp[no].pattern = [
	 ["MiniB", -1, -1 ]];
// Boss?
//=================================================
	no = 20;

	mp[no] = {};

	mp[no].pattern = [
	 ["Wave", -1, -1 ]];
// Laser
//=================================================
	no = 21;

	mp[no] = {};

	mp[no].pattern = [
	 ["Laser", -1, -1 ]];
// powerBall
//=================================================
	no = 22;

	mp[no] = {};

	mp[no].pattern = [
	 ["pBall", 0, 0 ]];

// enemyHormingLaser
//=================================================
	no = 23;

	mp[no] = {};

	mp[no].pattern = [
	 ["Laser2", -1, -1 ]];


//Option Gunpod
//=================================================
	no = 24;

	mp[no] = {};

	mp[no].pattern = [
	 ["Gunpod", 0, 0]];

//Warning
//=================================================
	no = 25;

	mp[no] = {};

	mp[no].pattern = [
	 ["Warn", 0, 0]];

//Coin
//=================================================
	no = 26;

	mp[no] = {};

	mp[no].wait = 5;
	mp[no].pattern = 
	[["Coin1", 0, 0 ]
	,["Coin2", 0, 0 ]
	,["Coin3", 0, 0 ]
	,["Coin4", 0, 0 ]
	,["Coin3", 2, 0 ]
	,["Coin2", 2, 0 ]
	,["Coin1", 2, 0 ]];


//kobold
//=================================================
	no = 27;

	mp[no] = {};

	mp[no].pattern = [
	 ["Kobold", 0, 0]];

//Warning
//=================================================
	no = 28;

	mp[no] = {};

	mp[no].pattern = [
	 ["Warn", 0, 0]];

//[s]r
//=================================================
	no = 29;

	mp[no] = {};

	mp[no].pattern = [
	 ["Bonus_r", 0, 0]];


//[s]g
//=================================================
	no = 30;

	mp[no] = {};

	mp[no].pattern = [
	 ["Bonus_g", 0, 0]];


//
//@@
	return mp;
}